app/views/messages/groupChat.html.erb

                <ul class="list-unstyled chat-list mt-2 mb-0">
                  <% for user in User.all%>
---
SELECT "users".* FROM "users"