app/views/users/index.html.erb

              <div class="mt-5">
                <div class="mt-3"> <h5 class="d-flex align-items-center mb-0"><%= pluralize(user.articles.count, "Article") %></h2></span> </div>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]