app/views/users/show.html.erb

              <div>
                <p class="mb-1 h5"><%= @user.articles.count %></p>
---
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]

            </div>
            <% if @user.articles.count == 0%>
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]