app/controllers/articles_controller.rb

    def index
        @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT "articles".* FROM "articles" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles"