app/controllers/articles_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "articles" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "New article with user"], ["description", "asdasadsd new "], ["created_at", "2023-12-26 08:59:12.884456"], ["updated_at", "2023-12-26 08:59:12.884456"], ["user_id", 1]]
---
    def create
      @article = Article.new(article_params)
      # This has been added for now till we have authentication system in place
      @article.user = User.first
      @res = @article.save

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "asdasdaskdjasdjsalkd updated new testing"], ["updated_at", "2023-12-19 13:34:22.062449"], ["id", 4]]
---
    def update
      @res = @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 5]]
---
    def destroy
      @res = @article.destroy