app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"
---
  def index
    @categories = Category.paginate(page: params[:page], per_page: 12)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT ? OFFSET ?  [["category_id", 10], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 10]]
SELECT COUNT(*) FROM "categories"
---
  def show
    @category = Category.find(params[:id])
    @articles = @category.articles.paginate(page: params[:page], per_page: 5)

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Bollywood"], ["created_at", "2024-02-02 18:55:45.332932"], ["updated_at", "2024-02-02 18:55:45.332932"]]
---
  def create
    @category = Category.new(category_params)
    res = @category.save