app/controllers/messages_controller.rb

INSERT INTO "messages" ("message", "from_user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    message = Message.new(message: params[:message], user: current_user)
    if message.save