app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at", "email", "password_digest", "profile_image") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new(user_params)
    user.profile_image = gravatar_link(user_params[:email])
    res = user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$wD8IpG70juxbIAXLn8N4L.sQfu1/5HLTq6//BVaDiM07tYwFOnxm6"], ["updated_at", "2023-12-26 12:54:40.670798"], ["id", 1]]
---
  def update
    if @user.update(user_params)

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 7]]
---
  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)

SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.paginate(page: params[:page], per_page: 6)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
---
  def destroy
    is_same_user_logged_in = @user == current_user
    user_status = @user.destroy