app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]